CFDEM/CFDEMcoupling/tutorials/cfdemSolverCatalyticReactingrhoPimpleMass/packedBedIsothermal-mass-PA-ISAT/CFD/constant/thermophysicalProperties.catalyst
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.catalyst;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gasThermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       logPolynomial;
    thermo          janaf;
    energy          sensibleInternalEnergy;
    equationOfState perfectGas;
    specie          specie;
}

solidThermoType
{
    type            heRhoThermo;
    mixture         multiComponentGSMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

#include "mechanism/thermo.catalyst"

// ************************************************************************* //
