CFDEM/CFDEMcoupling/tutorials/cfdemSolverCatalyticReactingrhoPimpleMass/packedBedIsothermal-mass-PA-ISAT/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libcatchyFiniteVolume.so");

application     cfdemSolverCatalyticReactingRhoPimpleMass;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.10;

deltaT          5e-8;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

functions
{
    #includeFunc    "outletAverage"
    
     fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs 	( "libcatchyFieldFunctionObjects.so" );
        enabled         true;
        writeControl    writeTime;
        timeStart	0.05;
		timeEnd		0.2;

	restartOnRestart false;
	restartOnOutput false;
	periodicRestart false;


        fields
        (
            voidfraction
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            P
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            CH4
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            O2
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            C2H2
            {
               mean         on;
               prime2Mean   on;
               base         time;
            }
            C2H4
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            C2H6
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            CO
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            CO2
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}

OptimisationSwitches 
{
    fileHandler uncollated;
}

// ************************************************************************* //
